Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/edc/PIC32MZ1024EFK124.PIC
      <edc:DCRDef edc:_addr="0x1FC54020" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:name="DEVSN0" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC54024" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:name="DEVSN1" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x40000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:kuseg="0x7f000000" edc:regionid="kseg0_data_mem"/>
    <edc:EBIDataSector edc:beginaddr="0x20000000" edc:endaddr="0x24000000" edc:kseg2="0xA0000000" edc:kseg3="0xC0000000" edc:regionid="ebi_data_mem"/>
    <edc:SQIDataSector edc:beginaddr="0x30000000" edc:endaddr="0x34000000" edc:kseg2="0xA0000000" edc:kseg3="0xC0000000" edc:regionid="sqi_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f801800" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb1_std">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-02787_WACD_Config.Module" edc:_refcount="1" edc:access="------nn------nn--nnn--nn-nnnn-n" edc:cname="CFGCON" edc:desc="" edc:impl="0x1819d9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00------00--000--0u-1100-1" edc:name="CFGCON" edc:nzwidth="0x20" edc:por="------00------00--000--0x-1100-1" edc:portals="- - -" ltx:baseofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TDOEN" edc:desc="" edc:mask="0x1" edc:name="TDOEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TROEN" edc:desc="" edc:mask="0x1" edc:name="TROEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="JTAGEN" edc:desc="" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ECCCON" edc:desc="" edc:mask="0x3" edc:name="ECCCON" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IOANCPN" edc:mask="0x1" edc:name="IOANCPN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBSSEN" edc:desc="" edc:mask="0x1" edc:name="USBSSEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PGLOCK" edc:desc="" edc:mask="0x1" edc:name="PGLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMDLOCK" edc:desc="" edc:mask="0x1" edc:name="PMDLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IOLOCK" edc:desc="" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="OCACLK" edc:desc="" edc:mask="0x1" edc:name="OCACLK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICACLK" edc:desc="" edc:mask="0x1" edc:name="ICACLK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CPUPRI" edc:desc="" edc:mask="0x1" edc:name="EXLPRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAPRI" edc:desc="" edc:mask="0x1" edc:name="DMAPRI" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="IOANCPEN" edc:mask="0x1" edc:name="IOANCPEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800010" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F800020" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02787_WACD_Config.Module" edc:_refcount="2" edc:access="rrrrnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVID" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DEVID" edc:nzwidth="0x20" edc:por="0000xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEVID" edc:desc="" edc:mask="0xfffffff" edc:name="DEVID" edc:nzwidth="28"/>
            <edc:SFRFieldDef edc:cname="VER" edc:desc="" edc:mask="0xf" edc:name="VER" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800030" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02787_WACD_Config.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYSKEY" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SYSKEY" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SYSKEY" edc:desc="" edc:mask="0xffffffff" edc:name="SYSKEY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800040" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02787_WACD_Config.Module" edc:_refcount="2" edc:access="-------------------n-----------n" edc:cname="PMD1" edc:desc="" edc:impl="0x1001" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0-----------0" edc:name="PMD1" edc:nzwidth="0x20" edc:por="-------------------0-----------0" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="CVRMD" edc:desc="" edc:mask="0x1" edc:name="CVRMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800050" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02787_WACD_Config.Module" edc:_refcount="2" edc:access="------------------------------nn" edc:cname="PMD2" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="PMD2" edc:nzwidth="0x20" edc:por="------------------------------00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
